describe('FP-18Deletefromthecart', () => {
  it('deletefromcart', () => {

//1. გახსენი საიტი.
//გაიხსნა საიტის მთავარი გვერდი.
cy.visit("https://testzootopia.loremipsum.ge/ka")
//2.დააჭირე მარჯვენა კუთხეში არსებულ ღილაკს “შესვლა”.
//გამოჩნდა ავტორიზაციის ფანჯარა.
//3.შეყვანე ელ.ფოსტა და პაროლი, დააჭირე ავტორიზაციის ღილაკს.
//Test Data:
//ელ.ფოსტა-anaartilakva1@gmail.com
//პაროლი- Anushka123
//ავტორიზაცია წარმატებით დასრულდა და გაიხსნა მთავარი გევრდი.
cy.avtorizacia()
//4.საძიებო ველში ჩაწერე შემდეგი პროდუქტის დასახელება: SANICAT CLASSIC TR 10L EUR.
cy.get('.popsrch').click().type('SANICAT CLASSIC TR 10L EUR')
cy.get('.menu-pop .popsrch.active button').click()
//დააჭირე ზედა მარჯვენა კუთხეში არსებულ კალათას ლოგოს.
//გაიხსნა კალათის გევრდი, სადაც დაგხვდება არჩეული პროდუქტი
//(პროდუქციის დასახელება: SANICAT CLASSIC TR 10L EUR
//პროდუქციის ID: #PSANCLAT010L31
//პროდუქციის ფასი: 21.90 ლარი)
//6. დააჭირე პროდუქტის მარჯვენა ზედა მხარეს არსებულ პროდუქტის წაშლის
//ღილაკს.
//პროდუაცია წარმატებით წაიშალა.
//Postconditions:პროდუქტის წაშლის ღილაკი წარმატებით ფუნქციონირებს.
//Expected Results:პროდუქტის წაშლის შემდეგ კალათა ცარიელია და გამოდის
//შესაბამისი შეტყობინება კალათის გვერდზე.
  })
})