describe('ValidRagistration', () => {
  it('Registracia', () => {
    

    //1. გახსენი საიტი.
    cy.visit("https://testzootopia.loremipsum.ge/ka")
    //გაიხსნა საიტის მთავარი გვერდი.
    //2.დააჭირე მარჯვენა კუთხეში არსებულ ღილაკს “შესვლა”.
    //გამოჩნდა ავტორიზაციის ფანჯარა.
    //3.დააჭირე ავტორიზაციის ფანჯარაზე არსებულ ნარინჯისფერ წარწერას “გაიარეთ
    //რეგისტრაცია”
    //გაიხსნა რეგისტრაციის გვერდი.
    //4.შეყვანე ვალიდური მონაცემები, მონიშნე ლოგო “ვეთანხმები წესებსა და პირობებს”
    //და დააჭირე რეგისტრაციას.
    cy.regist()
   // გაიხსნა მთავარი გვერდი, სადაც მარჯვენა ზედა კუთხეში “შესვლა” ღილაკის
    //ნაცვლად გამოჩნდება ღილაკი: “ჩემი გვერდი”.
    cy.get('.menu-pop > .iprof > p').should("be.visible")


  })
})