describe('Distermsregistration', () => {
    it('Distermsandconditions', () => {
//1. გახსენი საიტი.
//გაიხსნა საიტის მთავარი გვერდი.
cy.visit("https://testzootopia.loremipsum.ge/ka")
//2.დააჭირე მარჯვენა კუთხეში არსებულ ღილაკს “შესვლა”.
//გამოჩნდა ავტორიზაციის ფანჯარა.
//3.დააჭირე ავტორიზაციის ფანჯარაზე არსებულ ნარინჯისფერ წარწერას “გაიარეთ
//რეგისტრაცია”.
//გაიხსნა რეგისტრაციის გვერდი.
//4.შეიყვანე ვალიდური მონაცემები და დააჭირე რეგისტრაციას.
//Test Data: სახელი გვარი-Ana Artilakva
//ელ.ფოსტა-artilakva123@gmail.com
//პირადი ნომერი-01010101010
//ტელ.- 599119911
//პაროლი- Anushka123
//გაიმეორეთ პაროლი-Anushka123
 cy.disterms()
    })
})